mhd_heated_obstacle_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters    0.01;

vertices
(
    (0 -1 0)
    (9.5 -1 0)
    (10.5 -1 0)
    (20 -1 0)
    (0 -0.5 0)
    (9.5 -0.5 0)
    (10.5 -0.5 0)
    (20 -0.5 0)
    (0 1 0)
    (9.5 1 0)
    (10.5 1 0)
    (20 1 0)
    (0 -1 0.1)
    (9.5 -1 0.1)
    (10.5 -1 0.1)
    (20 -1 0.1)
    (0 -0.5 0.1)
    (9.5 -0.5 0.1)
    (10.5 -0.5 0.1)
    (20 -0.5 0.1)
    (0 1 0.1)
    (9.5 1 0.1)
    (10.5 1 0.1)
    (20 1 0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (60 25 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (60 25 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (60 30 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (12 30 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (60 30 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
        );
    }
    lowerleftWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
        );
    }
    lowerrightWall
    {
        type wall;
        faces
        (
            (2 3 15 14)
        );
    }            
    upperWall
    {
        type wall;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (2 6 7 3)
            (12 13 17 16)
            (16 17 21 20)
            (17 18 22 21)
            (14 15 19 18)
            (18 19 23 22)    
        );
    }
);
// ************************************************************************* //
